# Importar librería

In [1]:
import numpy as np
import pandas as pd

Para ver información

In [2]:
pd.Series?

In [3]:
pd.DataFrame?

# Series

A partir de  listas

In [4]:
l1 = list('abcd')
etiquetas = list(range(1,5))
s1 = pd.Series(l1,etiquetas)
s1

1    a
2    b
3    c
4    d
dtype: object

A partir de arreglos de numpy

In [5]:
arr1 = np.arange(1,5)
s2 = pd.Series(arr1)
s2

0    1
1    2
2    3
3    4
dtype: int64

In [6]:
arr2 = np.arange(5,9)
s3 = pd.Series(arr2)
s3

0    5
1    6
2    7
3    8
dtype: int64

Mientras las series tengan las mismas etiquetas y sean del mismo tamaño, se podrán realizar operaciones entre ellas

In [7]:
s2+s3

0     6
1     8
2    10
3    12
dtype: int64

In [8]:
s2-s3

0   -4
1   -4
2   -4
3   -4
dtype: int64

In [9]:
s2/s3

0    0.200000
1    0.333333
2    0.428571
3    0.500000
dtype: float64

In [10]:
s2**s3

0        1
1       64
2     2187
3    65536
dtype: int64

In [11]:
s3 % s2

0    0
1    0
2    1
3    0
dtype: int64

Y si tienen el tipo de dato adecuado, se pueden pasar a funciones de numpy

In [12]:
np.exp(s2)

0     2.718282
1     7.389056
2    20.085537
3    54.598150
dtype: float64

A partir de diccionarios

In [13]:
midic = {"nombre":"Pepe","apellido":"Botella","edad":33}
s3 = pd.Series(midic)
s3

nombre         Pepe
apellido    Botella
edad             33
dtype: object

# DataFrames

A partir de un arreglo de numpy

In [14]:
arr = np.random.randint(10,100,(3,3))
df1 = pd.DataFrame(arr,list('XYZ'),list('ABC'))
df1

    A   B   C
X  55  36  86
Y  15  14  41
Z  78  64  17

A partir de un diccionario

In [15]:
midic = {
    "uno": pd.Series(np.arange(1,4,dtype=np.float32),list('abc')),
    "dos": pd.Series(np.arange(1,5,dtype=np.float32),list('abcd'))
}
df2 = pd.DataFrame(midic)
df2

   uno  dos
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

# Lectura y edición de datos

In [16]:
df1

    A   B   C
X  55  36  86
Y  15  14  41
Z  78  64  17

Para leer una columna

In [17]:
df1['A']

X    55
Y    15
Z    78
Name: A, dtype: int64

Para leer varias columnas

In [18]:
df1[['A','C']]

    A   C
X  55  86
Y  15  41
Z  78  17

Para leer una fila

In [19]:
df1.loc['X']

A    55
B    36
C    86
Name: X, dtype: int64

Otra forma de leer una fila

In [20]:
df1.iloc[0]

A    55
B    36
C    86
Name: X, dtype: int64

Para leer un elemento

In [21]:
df1['A']['X']

55

In [22]:
df1.loc['X','A']

55

In [23]:
df1.loc[['X','Y'],['C','B']]

    C   B
X  86  36
Y  41  14

Para crear una nueva columna

In [24]:
df1['Suma'] = df1['A']+df1['B']+df1['C']
df1

    A   B   C  Suma
X  55  36  86   177
Y  15  14  41    70
Z  78  64  17   159

Para eliminar una columna

In [25]:
df1.drop('Suma',axis=1,inplace=True)
df1

    A   B   C
X  55  36  86
Y  15  14  41
Z  78  64  17

Otra manera de hacer la columna suma

In [26]:
df1['Suma'] = df1.sum(axis=1)
df1

    A   B   C  Suma
X  55  36  86   177
Y  15  14  41    70
Z  78  64  17   159

Fila nueva a partir de un diccionario.

In [27]:
filanue = dict(zip(list('ABC'),np.random.randint(10,100,3)))
filanue

{'A': 43, 'B': 49, 'C': 99}

In [28]:
df1 = df1.append(pd.Series(filanue,name='W'))
df1

      A     B     C   Suma
X  55.0  36.0  86.0  177.0
Y  15.0  14.0  41.0   70.0
Z  78.0  64.0  17.0  159.0
W  43.0  49.0  99.0    NaN

Para eliminar una fila

In [29]:
df1.drop('W',axis=0,inplace=True)
df1

      A     B     C   Suma
X  55.0  36.0  86.0  177.0
Y  15.0  14.0  41.0   70.0
Z  78.0  64.0  17.0  159.0

# Selección condicional

In [30]:
arr = np.random.randint(10,50,(2,3))
df = pd.DataFrame(arr,list('AB'),list('XYZ'))
df

    X   Y   Z
A  18  17  44
B  28  45  14

In [31]:
df > 30

       X      Y      Z
A  False  False   True
B  False   True  False

In [32]:
df.gt(30)

       X      Y      Z
A  False  False   True
B  False   True  False

In [33]:
df[df > 30]

    X     Y     Z
A NaN   NaN  44.0
B NaN  45.0   NaN

In [34]:
df['X'] > 35

A    False
B    False
Name: X, dtype: bool

In [35]:
df[df['X'] > 35]

Empty DataFrame
Columns: [X, Y, Z]
Index: []

In [36]:
df['X'][df['X'] > 35]

Series([], Name: X, dtype: int64)

In [37]:
df[df['X'] > 35]['Y']

Series([], Name: Y, dtype: int64)

In [38]:
df[df['X'] > 35][['Y','Z']]

Empty DataFrame
Columns: [Y, Z]
Index: []

In [39]:
arr = np.random.randint(1,10,(3,3))
df = pd.DataFrame(arr,list('ABC'),list('XYZ'))
df

   X  Y  Z
A  4  5  6
B  8  8  6
C  2  4  3

In [40]:
df[(df['X'] > 3) & (df['X'] < 9)]

   X  Y  Z
A  4  5  6
B  8  8  6

# Operaciones básicas

Para abrir un archivo csv

In [41]:
zoo = pd.read_csv('zoo.csv',delimiter=',')

In [42]:
type(zoo)

pandas.core.frame.DataFrame

Primeros elementos

In [43]:
zoo.head()

     animal  uniq_id  water_need
0  elephant     1001       500.0
1  elephant     1002       600.0
2  elephant     1003       550.0
3     tiger     1004       300.0
4     tiger     1005       320.0

Últimos elementos

In [44]:
zoo.tail()

      animal  uniq_id  water_need
17      lion     1018       500.0
18      lion     1019       390.0
19  kangaroo     1020       410.0
20  kangaroo     1021       430.0
21  kangaroo     1022         NaN

Los dos primeros elementos

In [45]:
zoo[:2]

     animal  uniq_id  water_need
0  elephant     1001       500.0
1  elephant     1002       600.0

Elementos del 0 al 5, saltando a pasos de 2

In [46]:
zoo[0:5:2]

     animal  uniq_id  water_need
0  elephant     1001       500.0
2  elephant     1003       550.0
4     tiger     1005       320.0

Para convertirlo en un arreglo de numpy

In [47]:
zoo.to_numpy()

array([['elephant', 1001, 500.0],
       ['elephant', 1002, 600.0],
       ['elephant', 1003, 550.0],
       ['tiger', 1004, 300.0],
       ['tiger', 1005, 320.0],
       ['tiger', 1006, 330.0],
       ['tiger', 1007, 290.0],
       ['tiger', 1008, 310.0],
       ['zebra', 1009, 200.0],
       ['zebra', 1010, 220.0],
       ['zebra', 1011, 240.0],
       ['zebra', 1012, 230.0],
       ['zebra', 1013, 220.0],
       ['zebra', 1014, 100.0],
       ['zebra', 1015, 80.0],
       ['lion', 1016, 420.0],
       ['lion', 1017, 600.0],
       ['lion', 1018, 500.0],
       ['lion', 1019, 390.0],
       ['kangaroo', 1020, 410.0],
       ['kangaroo', 1021, 430.0],
       ['kangaroo', 1022, nan]], dtype=object)

Para reemplazar los "Nan" con algún valor

In [48]:
zoo.fillna(0)

      animal  uniq_id  water_need
0   elephant     1001       500.0
1   elephant     1002       600.0
2   elephant     1003       550.0
3      tiger     1004       300.0
4      tiger     1005       320.0
5      tiger     1006       330.0
6      tiger     1007       290.0
7      tiger     1008       310.0
8      zebra     1009       200.0
9      zebra     1010       220.0
10     zebra     1011       240.0
11     zebra     1012       230.0
12     zebra     1013       220.0
13     zebra     1014       100.0
14     zebra     1015        80.0
15      lion     1016       420.0
16      lion     1017       600.0
17      lion     1018       500.0
18      lion     1019       390.0
19  kangaroo     1020       410.0
20  kangaroo     1021       430.0
21  kangaroo     1022         0.0

In [49]:
arr = np.random.randint(50,100,(3,3))
df = pd.DataFrame(arr,list('ABC'),list('XYZ'))
df

    X   Y   Z
A  91  77  62
B  74  75  82
C  58  61  98

Se coge una fila

In [50]:
fila = df.iloc[1]
fila

X    74
Y    75
Z    82
Name: B, dtype: int64

Suma los elementos de esa fila al DataFrame según su índice

In [51]:
df.add(fila,axis='columns')

     X    Y    Z
A  165  152  144
B  148  150  164
C  132  136  180

Se coge una columna

In [52]:
columna = df['X']
columna

A    91
B    74
C    58
Name: X, dtype: int64

Suma los elementos de esa columna al DataFrame según su índice

In [53]:
df.add(columna,axis='rows')

     X    Y    Z
A  182  168  153
B  148  149  156
C  116  119  156

In [54]:
df.transform(lambda x:np.sqrt(x))

          X         Y         Z
A  9.539392  8.774964  7.874008
B  8.602325  8.660254  9.055385
C  7.615773  7.810250  9.899495

# Agrupar datos

In [55]:
dic = {
    'tienda':[1,2,1,2],
    'sabor':['chocolate','vainilla','fresa','chocolate'],
    'ventas':[26,12,18,22]
}
df = pd.DataFrame(dic)
df

   tienda      sabor  ventas
0       1  chocolate      26
1       2   vainilla      12
2       1      fresa      18
3       2  chocolate      22

Agrupar por tienda

In [56]:
portienda = df.groupby('tienda')
portienda

Promedio por tienda

In [57]:
portienda.mean()

        ventas
tienda
1         22.0
2         17.0

Total por tienda

In [58]:
portienda.sum()

        ventas
tienda
1           44
2           34

In [59]:
portienda.sum().loc[1]

ventas    44
Name: 1, dtype: int64

In [60]:
portienda.sum().loc[2]

ventas    34
Name: 2, dtype: int64

In [61]:
portienda.describe()

       ventas
        count  mean       std   min   25%   50%   75%   max
tienda
1         2.0  22.0  5.656854  18.0  20.0  22.0  24.0  26.0
2         2.0  17.0  7.071068  12.0  14.5  17.0  19.5  22.0

# Concatenar datos

In [62]:
df1 = pd.DataFrame({
    'A':[1,2,3],
    'B':[4,5,6]
    },
    index=[1,2,3]
)

df2 = pd.DataFrame({
    'A':[7,8,9],
    'B':[10,11,12]
    },
    index=[4,5,6]
)

pd.concat([df1,df2])

   A   B
1  1   4
2  2   5
3  3   6
4  7  10
5  8  11
6  9  12

In [63]:
df1 = pd.DataFrame({
    'A':[1,2,3],
    'B':[4,5,6]
    },
    index=[1,2,3]
)

df2 = pd.DataFrame({
    'A':[7,8,9],
    'B':[10,11,12]
    },
    index=[1,2,3]
)

pd.concat([df1,df2])

   A   B
1  1   4
2  2   5
3  3   6
1  7  10
2  8  11
3  9  12

# Estadísticas

In [64]:
zoo = pd.read_csv('zoo.csv',delimiter=',')

In [65]:
zoo

      animal  uniq_id  water_need
0   elephant     1001       500.0
1   elephant     1002       600.0
2   elephant     1003       550.0
3      tiger     1004       300.0
4      tiger     1005       320.0
5      tiger     1006       330.0
6      tiger     1007       290.0
7      tiger     1008       310.0
8      zebra     1009       200.0
9      zebra     1010       220.0
10     zebra     1011       240.0
11     zebra     1012       230.0
12     zebra     1013       220.0
13     zebra     1014       100.0
14     zebra     1015        80.0
15      lion     1016       420.0
16      lion     1017       600.0
17      lion     1018       500.0
18      lion     1019       390.0
19  kangaroo     1020       410.0
20  kangaroo     1021       430.0
21  kangaroo     1022         NaN

Conteo de elementos según su categoría

In [66]:
zoo.count()

animal        22
uniq_id       22
water_need    21
dtype: int64

Suma de los elementos según su categoría

In [67]:
zoo.sum()

animal        elephantelephantelephanttigertigertigertigerti...
uniq_id                                                   22253
water_need                                               7240.0
dtype: object

Suma evitando los Nan

In [68]:
zoo.sum(skipna=True)

animal        elephantelephantelephanttigertigertigertigerti...
uniq_id                                                   22253
water_need                                               7240.0
dtype: object

In [69]:
zoo['uniq_id']

0     1001
1     1002
2     1003
3     1004
4     1005
5     1006
6     1007
7     1008
8     1009
9     1010
10    1011
11    1012
12    1013
13    1014
14    1015
15    1016
16    1017
17    1018
18    1019
19    1020
20    1021
21    1022
Name: uniq_id, dtype: int64

Suma de los 'uniq_id'

In [70]:
zoo['uniq_id'].sum()

22253

Suma acumulada

In [71]:
zoo['uniq_id'].cumsum()

0      1001
1      2003
2      3006
3      4010
4      5015
5      6021
6      7028
7      8036
8      9045
9     10055
10    11066
11    12078
12    13091
13    14105
14    15120
15    16136
16    17153
17    18171
18    19190
19    20210
20    21231
21    22253
Name: uniq_id, dtype: int64

Media aritmética

In [72]:
zoo['uniq_id'].mean()

1011.5

Desviación estándar

In [73]:
zoo['uniq_id'].std()

6.493586579592718

Varianza

In [74]:
zoo['uniq_id'].var()

42.166666666666664

Mínimo

In [75]:
zoo['uniq_id'].min()

1001

Mínimo acumulado

In [76]:
zoo['uniq_id'].cummin()

0     1001
1     1001
2     1001
3     1001
4     1001
5     1001
6     1001
7     1001
8     1001
9     1001
10    1001
11    1001
12    1001
13    1001
14    1001
15    1001
16    1001
17    1001
18    1001
19    1001
20    1001
21    1001
Name: uniq_id, dtype: int64

Máximo

In [77]:
zoo['uniq_id'].max()

1022

Máximo acumulado

In [78]:
zoo['uniq_id'].cummax()

0     1001
1     1002
2     1003
3     1004
4     1005
5     1006
6     1007
7     1008
8     1009
9     1010
10    1011
11    1012
12    1013
13    1014
14    1015
15    1016
16    1017
17    1018
18    1019
19    1020
20    1021
21    1022
Name: uniq_id, dtype: int64

Error estándar

In [79]:
zoo['uniq_id'].sem()

1.3844373104863457

Reporte general del DataFrame

In [80]:
zoo.describe()

           uniq_id  water_need
count    22.000000   21.000000
mean   1011.500000  344.761905
std       6.493587  150.519735
min    1001.000000   80.000000
25%    1006.250000  230.000000
50%    1011.500000  320.000000
75%    1016.750000  430.000000
max    1022.000000  600.000000

In [81]:
ser = pd.Series([1]*5 + [2]*3 + [5]*9)
ser

0     1
1     1
2     1
3     1
4     1
5     2
6     2
7     2
8     5
9     5
10    5
11    5
12    5
13    5
14    5
15    5
16    5
dtype: int64

In [82]:
ser.value_counts()

5    9
1    5
2    3
dtype: int64

# Iteradores

In [83]:
ser = pd.Series(range(5),list('abcde'))
ser

a    0
b    1
c    2
d    3
e    4
dtype: int64

In [84]:
for s in ser:
    print(s)

0
1
2
3
4

In [85]:
arr = np.random.randint(10,50,(3,3))
df = pd.DataFrame(arr, list('ABC'), list('XYZ'))
df

    X   Y   Z
A  21  30  29
B  24  13  31
C  17  42  43

In [86]:
for a,b in df.items():
    print(a)
    print(b)

X
A    21
B    24
C    17
Name: X, dtype: int64
Y
A    30
B    13
C    42
Name: Y, dtype: int64
Z
A    29
B    31
C    43
Name: Z, dtype: int64

In [87]:
for a,b in df.iterrows():
    print(a)
    print(b)

A
X    21
Y    30
Z    29
Name: A, dtype: int64
B
X    24
Y    13
Z    31
Name: B, dtype: int64
C
X    17
Y    42
Z    43
Name: C, dtype: int64

# Ordenamiento

In [88]:
df

    X   Y   Z
A  21  30  29
B  24  13  31
C  17  42  43

In [89]:
df.sort_index(ascending=False)

    X   Y   Z
C  17  42  43
B  24  13  31
A  21  30  29

In [90]:
df.sort_values(by='Y')

    X   Y   Z
B  24  13  31
A  21  30  29
C  17  42  43

# Alineamiento, Reindexado y renombrar etiquetas

In [91]:
ser = pd.Series(range(5),list('abcde'))
ser

a    0
b    1
c    2
d    3
e    4
dtype: int64

In [92]:
parte1 = ser[:3]
parte1

a    0
b    1
c    2
dtype: int64

In [93]:
parte2 = ser[1:]
parte2

b    1
c    2
d    3
e    4
dtype: int64

In [94]:
parte1.align(parte2)

(a    0.0
 b    1.0
 c    2.0
 d    NaN
 e    NaN
 dtype: float64,
 a    NaN
 b    1.0
 c    2.0
 d    3.0
 e    4.0
 dtype: float64)

In [95]:
parte1.align(parte2,join='left')

(a    0
 b    1
 c    2
 dtype: int64,
 a    NaN
 b    1.0
 c    2.0
 dtype: float64)

In [96]:
parte1.align(parte2,join='right')

(b    1.0
 c    2.0
 d    NaN
 e    NaN
 dtype: float64,
 b    1
 c    2
 d    3
 e    4
 dtype: int64)

In [97]:
parte1.align(parte2,join='inner')

(b    1
 c    2
 dtype: int64,
 b    1
 c    2
 dtype: int64)

In [98]:
arr = np.random.randint(10,50,(3,3))
df = pd.DataFrame(arr, list('ABC'), list('XYZ'))

In [99]:
df

    X   Y   Z
A  26  43  27
B  20  38  19
C  17  31  14

In [100]:
df.reindex(list('BC'))

    X   Y   Z
B  20  38  19
C  17  31  14

Para cambiar de nombre a las columnas

In [101]:
df.rename(columns={'X':'escolares','Y':'universitarios','Z':'profesionales'})

   escolares  universitarios  profesionales
A         26              43             27
B         20              38             19
C         17              31             14

# Multiples índices

In [102]:
dias = ['dia 1']*3 + ['dia 2']*3
dias

['dia 1', 'dia 1', 'dia 1', 'dia 2', 'dia 2', 'dia 2']

In [103]:
comidas = list(range(1,4))*2
comidas

[1, 2, 3, 1, 2, 3]

In [104]:
indices = pd.MultiIndex.from_tuples(list(zip(dias,comidas)))
indices

MultiIndex([('dia 1', 1),
            ('dia 1', 2),
            ('dia 1', 3),
            ('dia 2', 1),
            ('dia 2', 2),
            ('dia 2', 3)],
           )

In [105]:
arr = np.random.randint(100,300,(6,2))
df = pd.DataFrame(arr,indices,['M','F'])
df

           M    F
dia 1 1  138  215
      2  174  288
      3  117  236
dia 2 1  198  101
      2  203  269
      3  154  132

In [106]:
df.loc['dia 2']

     M    F
1  198  101
2  203  269
3  154  132

In [107]:
df.loc['dia 2'].loc[3]

M    154
F    132
Name: 3, dtype: int64

In [108]:
df.loc['dia 2'].loc[3]['F']

132

In [109]:
df.index.names = ['dia','comida']
df

                M    F
dia   comida
dia 1 1       138  215
      2       174  288
      3       117  236
dia 2 1       198  101
      2       203  269
      3       154  132

In [110]:
df.xs('dia 2')

          M    F
comida
1       198  101
2       203  269
3       154  132

In [111]:
df.xs(1,level='comida')

         M    F
dia
dia 1  138  215
dia 2  198  101

In [112]:
df.xs(2,level='comida')

         M    F
dia
dia 1  174  288
dia 2  203  269

# Cuando faltan datos

In [123]:
l1 = list(range(1,3)) + [np.nan]
l2 = [4] + [np.nan]*2
l3 = list(range(7,10))
df = pd.DataFrame({'A':l1,'B':l2,'C':l3})
df

     A    B  C
0  1.0  4.0  7
1  2.0  NaN  8
2  NaN  NaN  9

Sacar todas las filas que contengan NaN

In [124]:
df.dropna()

     A    B  C
0  1.0  4.0  7

Sacar todas las columnas que contengan NaN

In [125]:
df.dropna(axis=1)

   C
0  7
1  8
2  9

Reemplazar todos los Nan con 0.0

In [126]:
df.fillna(value=0)

     A    B  C
0  1.0  4.0  7
1  2.0  0.0  8
2  0.0  0.0  9

Reemplazar todos los Nan con 1.0

In [127]:
df.fillna(value=1)

     A    B  C
0  1.0  4.0  7
1  2.0  1.0  8
2  1.0  1.0  9